import pygame
from pygame.draw import *
pygame.init()
FPS=30
screen = pygame.display.set_mode((500, 350))
screen.fill('peachpuff')
#sun
def sun(a,b,c,x,y,r):
    '''
    Рисует солнце на небе.
    a,b,c - RGB цвет солнца
    x, y - координаты центра солнца
    r - радиус солнца
    '''
    circle(screen,(a,b,c),(x,y),r)
#land
def land(a,b,c,d):
    '''
        Рисует солнце на небе.
        a,b,c - RGB цвет солнца
        [(),(),..] - координаты x y для большого прямоугольника, являющегося землей
        d - толщина полоски, отвечающей за землю
    '''
    rect(screen,(a,b,c),[(0,300),(500,300)],d)
#cloud
def cloud(a,b,c,d):
    '''
        Рисует солнце на небе.
        a,b,c - RGB цвет солнца
        [(),(),..] - координаты x y для большого прямоугольника, являющегося небом
        d - толщина полоски, отвечающей за землю
    '''
    rect(screen,(a,b,c),[(0,150),(500,150,)],d)
#rock1
def rock(a,b,c):
    '''
        Рисует солнце на небе.
        a,b,c - RGB цвет солнца
        [(),(),..] - координаты x y для большого многоугольника, отвечающего за гору
        d - толщина полоски, отвечающей за землю
    '''
    polygon(screen, (a, b, c), [(0, 200), (75, 110), (75, 110), (84, 127), (84, 127), (120, 120),
                                    (120, 120), (180, 180),
                                    (180, 180), (250, 170),
                                    (250, 170), (300, 190),
                                    (300, 190), (350, 200)], )
    polygon(screen, (a, b, c), [(360, 200), (400, 150),
                                    (400, 150), (450, 100),
                                    (450, 100), (500, 80), (500, 200)], )

# rock2
def rock2(a,b,c):
    '''
        Рисует солнце на небе.
        a,b,c - RGB цвет солнца
        [(),(),..] - координаты x y для большого многоугольника, отвечающего за гору
        d - толщина полоски, отвечающей за землю
    '''
    polygon(screen, (a, b, c), [(0, 300), (75, 200), (75, 190), (84, 200), (84, 200), (120, 220),
                                  (120, 200), (180, 220),
                                  (180, 200), (250, 230),
                                  (250, 230), (300, 200), (310, 100),
                                  (320, 150), (350, 300)], )
    polygon(screen, (a, b, c), [(380, 300), (400, 200), (400, 300), (420, 250), (470, 200), (500, 150), (500, 300)])
